Repository: joshanashakya/literature_review
Catalog: workspace/opus_corpus/wikimediav20210402(2.8k)/en-ne.tmx
Source language: en
Languages: ne

source: Its many large reservoirs provide irrigation and hydroelectric power. The Moscow Canal, the Volga–Don Canal, and the Volga–Baltic Waterway form navigable waterways connecting Moscow to the White Sea, the Baltic Sea, the Caspian Sea, the Sea of Azov and the Black Sea. High levels of chemical pollution have adversely affected the river and its habitats.
ne: भोल्गाले पश्चिमी रूसको अधिकांश भाग सिंचित गर्छ । यसका धेरै ठूला जलाशयहरूले सिंचाइ र जलविद्युत उर्जा प्रदान गर्दछ। मस्को क्यानाल, भोल्गा – डोन नहर, र भोल्गा बाल्टिक जलमार्गले मस्कोलाई सेतो सागर, बाल्टिक सागर, क्यास्परियन सागर, आजोभको समुद्री किनार र कृष्ण समुद्रसंग जोड्ने समुद्री जलमार्ग बनेको छ । उच्च स्तरको रासायनिक प्रदूषणले नदी र यसका वासस्थानमा प्रतिकूल असर गरेको छ।

source: The fertile river valley provides large quantities of wheat, and also has many mineral riches. A substantial petroleum industry centers on the Volga valley. Other resources include natural gas, salt, and potash.
ne: उर्वरा नदी उपत्यकाले गहुँको ठूलो मात्रामा उत्पादन हुन्छ, र यसमा धेरै खनिज सम्पत्तिहरू पनि छन्। भोलगा उपत्यकामा पर्याप्त पेट्रोलियम उद्योग केन्द्रहरू केन्द्रित छन् । अन्य स्रोतहरूमा प्राकृतिक ग्यास, नुन, र पोटाश सामेल छन् । भोल्गा डेल्टा र क्यास्परियन समुद्री माछा मार्ने मैदानहरू हुन्। अस्ट्रखान, डेल्टामा, क्याभियार उद्योगको केन्द्र हो।

source: The river flows in Russia through forests, forest-steppes and steppes. Eleven of the twenty largest cities of Russia, including the capital, Moscow, are located in the Volga's drainage basin.
ne: यो नदी रूसमा जङ्गल, स्टेप्पहरू र स्टेप्प घाँसे मैदानहरू हुँदै बग्दछ । राजधानी मस्को सहित रसियाका बीस ठूला शहरहरू मध्ये ११ वटा शहरहरू भोल्गाको जलाधार/ सिंचित क्षेत्रमा अवस्थित छन्।

source: Some of the largest reservoirs in the world are located along the Volga. The river has a symbolic meaning in Russian culture and is often referred to as Волга-матушка Volga-Matushka (Mother Volga) in Russian literature and folklore.
ne: संसारका केही ठूला जलाशयहरू भोल्गाको आसपासमा अवस्थित छन्। रूसी संस्कृतिमा यो नदीको एक प्रतीकात्मक अर्थ छ र अक्सर रूपमा रूसी साहित्य र भोल्गालाई लोकगीत Волга-матушка भोल्गा-मतुस्का (भोल्गा माता)को रुपमा उल्लेख गरिन्छ।

source: Integrated reporting (IR, or <IR> in International Integrated Reporting Council publications) in corporate communication is a "process that results in communication, most visibly a periodic “integrated report”, about value creation over time. An integrated report is a concise communication about how an organization's strategy, governance, performance and prospects lead to the creation of value over the short, medium and long term."[1]
ne: एकिकृत प्रस्तुतिकरण भन्नाले संस्थागत सञ्चारमा कम्पनीले निश्चित समयमा कति संस्थागत मूल्य श्रृजना गरेको सम्बन्धमा आवधिक रूपमा एकिकृत प्रतिवेदनको माध्यमबाट सुसुचित गराउने प्रक्रिया हो । एकिकृत प्रतिवेदन संस्थाको रणनीति, सुशासन, कार्य सम्पादन तथा भविष्यको कार्यबाट अल्पकालिन, मध्यकालिन तथा दिर्घकालिन अवधिमा कसरी संस्थागत मूल्यको श्रृजना गर्छ भन्ने बारे एउटा संक्षिप्त सञ्चार गर्ने प्रक्रिया हो ।

source: Admiralteysky Municipal Okrug (Russian: Адмиралте́йский муниципа́льный о́круг) is a municipal okrug of Admiralteysky District of the federal city of St. Petersburg, Russia. Population: 22,634 (2010 Census);[1] 30,533 (2002 Census).[2]
ne: म्यूनिसिपल ओक्रग ( Russian ) संघीय शहर सेन्ट पीटर्सबर्ग, रूसको Admiralteysky जिल्ला को एक नगरपालिका Okrug हो। । जनसंख्या: 22,634 ( २०१० जनगणना ) 30,533 ( २००२ जनगणना )

source: It borders the Neva River in the north, New Admiralty Canal and Kryukov Canal in the west, Fontanka in the south, and Voznesensky Avenue and the Moyka River in the east.
ne: यसको सीमाना उत्तरमा Neva नदी पश्चिममा नयाँ Admiralty नहर र Kryukov नहर ,दक्षिणमा Fontanka र पूर्वमा Voznesensky एवेन्यू र Moyka नदी रहेको छ।

source: Munni Saha is a Bangladeshi journalist and television host [1] [2]who mainly works ATN News.[3] She is the news head of ATN News,[4] [5] a leading news broadcasting of Bangladesh.[6]
ne: मुन्नी साह एक बंगलादेशी पत्रकार र टेलिभिजन होस्ट हुन्। [१] [२]

source: He is the Shirley and Leonard Ely Professor of Humanities and Sciences at Stanford University, a position he has held since 1987. Milgrom is an expert in game theory, specifically auction theory and pricing strategies. He is the winner of the 2020 Nobel Memorial Prize in Economic Sciences, together with Robert B. Wilson, "for improvements to auction theory and inventions of new auction formats".[1][2]
ne: पल रोबर्ट मिलग्रोम (जन्म: २० अप्रिल, १९४८) एक अमेरिकी अर्थशास्त्री हुन् । उनी अमेरिकास्थित स्टानफोर्ड विश्वविद्यालयमा १९८७ देखि मानविकी र विज्ञानका शिर्ली र लियोनार्ड इली प्राध्यापक हुन्, मिलग्रोम खेल सिद्धान्त, विशेष रूपमा लिलामी सिद्धान्त र मूल्य निर्धारण रणनीतिहरूमा विशेषज्ञ हुन् । "लिलामीको सिद्धान्तमा सुधार र लिलामीको नयाँ विधिको विकासका लागि" उनलाई रोबर्ट बी विल्सनसँग मिलेर अर्थशास्त्रतर्फ २०२० का नोबेल मेमोरियल पुरस्कार प्रदान गरिएको थियो । [१] [२]

source: Ferrell's supporting roles in films include performances in Deadly Hero, Network, Edward Scissorhands, Erin Brockovich, Crime and Punishment in Suburbia, Mr. Deeds and K-PAX as well as a small part in True Romance. Her other television credits include Buffy the Vampire Slayer, Hot l Baltimore, Teen Angel, Matlock, B. J. and the Bear, Good Times, Hearts Afire, Townies, Night Court, The Love Boat and Push, Nevada.[1] She played Mrs. Werner in the episode of Quincy, M.E. titled "Into the Murdering Mind" (1982). She has also made memorable appearances portraying blunt, authoritative judges (the "Jagged Sledge" episode of Sledge Hammer! in 1987, and on "The One with Joey's Porsche" episode of Friends in 1999).[11]
ne: चलचित्रहरूमा फेरेलको सहयोगी भूमिकामा डेडली हीरो, नेटवर्क, एडवर्ड सिसोरहेंड्स, इरिन ब्रोकोविच, सबर्बियामा अपराध र सजाय, श्री डीड्स र K-PAX साथै ट्रान्स रोमान्सको सानो अंशको प्रदर्शन समावेश छ। उनको अन्य टेलिभिजन क्रेडिटहरूमा बफी भम्पायर स्लेयर, हट एल बाल्टिमोर, टीन एन्जेल, म्याटलक, बीजे र भालु, गुड टाइम्स, हार्ट अफर, टाउनीज, नाइट कोर्ट, द लभ बोट एण्ड पुश, नेवादा शामिल छन् । [१] उनी श्रीमती खेले क्विन्सीको एपिसोडमा भर्नर, ME शीर्षक "ईन्ट द मर्डरिंग माइन्ड" (१९8२)। उनले कुरो, आधिकारिक न्यायाधीशहरू (१९87 मा स्लेज हम्मरको "जग्ड स्लेज" एपिसोड, र १९९९ in मा फ्रेन्ड्सको "द जोन पोर्श" एपिसोड) मा चित्रण गरी अविस्मरणीय प्रदर्शनहरू पनि गरिन। [१]

source: She accepted a role in the off-Broadway play Love, Loss, and What I Wore for an April 27 through May 29, 2011, run with Minka Kelly, AnnaLynne McCord, Anne Meara, and B. Smith.[14]
ne: उनले अप्रिल देखि मे २०११ मा अफ-ब्रॉडवे नाटक प्रेम, घाटा, र मैले के लगाएकोमा भूमिका स्वीकारिन्, जुन मिन्का केली, अन्नालिने म्याकोर्ड, एनी मीरा, र बी स्मिथसँग चल्थिन् । [१]

source: Although she was a regular cast member of five TV sitcom series, she was best known for playing Berta the housekeeper for all twelve seasons of Two and a Half Men. For her performance as Berta, she received two Primetime Emmy Award nominations for Outstanding Supporting Actress in a Comedy Series (in 2005 and 2007). Those came in addition to an earlier nomination for Outstanding Supporting Actress in a Drama Series for her performance in L.A. Law (1992).
ne: कान्छाटा ग्यालेन फेरेल (मार्च २८, 1943) – अक्टोबर १२, २०२०) एक अमेरिकी अभिनेत्री थिइन। यद्यपि उनी TV टिभी सिटकम नियमित कास्ट सदस्य भएकी थिइन, उनी Two and a Half Men सबै बाह्र सत्रहरूका लागि बेर्टा हाउसकीपर खेल्नेका लागि परिचित थिए। बेर्टाको रूपमा उनको अभिनयका लागि उनले हास्य श्रृंखलामा उत्कृष्ट समर्थन अभिनेत्रीका लागि दुई प्राइमटाइम एमी पुरस्कार नामांकनहरू प्राप्त गरे (२०० and र २०० in मा)। ती ला कानुन (१९९२) मा उनको अभिनयको लागि नाटक श्रृंखलामा उत्कृष्ट समर्थन अभिनेत्रीको लागि पहिलेको नामांकन बाहेक आयो।

source: Conchata Galen Ferrell was born March 28, 1943, in Loudendale, West Virginia, to Mescal Loraine (née George) and Luther Martin Ferrell.[1][2][3] She was raised in Charleston, West Virginia. Her family later moved to Circleville, Ohio.[4][5]
ne: कान्छाटा ग्यालेन फेरेलको जन्म मार्च २८, 1943 पश्चिम वर्जीनियाको लुडेन्डेलमा मेस्कल लोरेन ( नी जर्ज) र लुथर मार्टिन फेरेलमा भएको थियो। [१] [२] []] उनी हुर्केकी चारस्टेल्टन, वेस्ट भर्जिनिया । उनको परिवार पछि सर्कलभिल, ओहायोमा सरे। []] []]

source: Ferrell began her career on the stage as a member of the Circle Repertory Company. She appeared in the original Off-Broadway cast of Lanford Wilson's The Hot l Baltimore[6] and won the Drama Desk, Obie and Theatre World Best Actress Awards for her performance in the off-Broadway play The Sea Horse.[2][7][8][9][10]
ne: फेरेलले सर्कल रेपरटरी कम्पनीको सदस्यको रूपमा स्टेजमा उनको क्यारियर शुरू गर्नुभयो। उनी ल्यानफोर्ड विल्सनको द हट हॉट बाल्टिमोर [१] को मूल अफ-ब्रॉडवे कास्टमा देखा पर्छिन् र अफ-ब्रॉडवे प्ले द सी हार्समा अभिनयका लागि ड्रामा डेस्क, ओबी र थिएटर वर्ल्ड सर्वश्रेष्ठ अभिनेत्री पुरस्कार जितिन्। [२] []] []] []] []]

source: Acting on stage, television and film for decades, she may have originally been best known for her starring role as the frontier housekeeper in the 1979 feature film Heartland directed by Richard Pearce, and as the tough-talking owner of Mystic Pizza, co-starring alongside Lili Taylor, Annabeth Gish, and Julia Roberts, who portrayed pizza waitresses. She also played a tough, comical nurse on the short-lived 1980s TV sitcom E/R.[11]
ne: दशकौंसम्म मञ्च, टेलिभिजन र फिल्ममा अभिनय गर्दै उनी १९7९ feature फिचर फिल्म हार्टल्याण्डमा रिचर्ड पियर्स निर्देशित, र मिस्टिक पिज्जाको सह-अभिनय गर्ने कडा कुरा गर्ने मालिकको रूपमा अभिनय गर्ने मुख्य पात्र हो। लिली टेलरको साथ, अन्नाबेथ गिश, र जुलिया रॉबर्ट्स, जसले पिज्जा वेट्रेसहरूको चित्रण गरे।

source: In 1992, she received her first Primetime Emmy Award nomination for Outstanding Supporting Actress in a Drama Series for her recurring role as Attorney Susan Bloom on the sixth season of L.A. Law, but lost to Valerie Mahaffey for Northern Exposure. She had previously appeared in an episode of the show in 1988 as Lorna Landsberg, an entirely different character.[1][2]
ne: १९९२ मा, उनले एलए कानूनको छैटौं सत्रमा अटार्नी सुसन ब्लोमको पुनरावर्ती भूमिकाको लागि नाटक श्रृंखलामा उत्कृष्ट समर्थन अभिनेत्रीको लागि पहिलो प्राइमटाइम एमी पुरस्कार नामांकन प्राप्त गर्‍यो, तर उत्तरी एक्सपोजरका लागि भ्यालेरी महफीसँग उनको हार भयो। उनी यसअघिको कार्यक्रमको एक एपिसोडमा १९88 मा लोर्ना ल्यान्ड्सबर्गको रुपमा देखा पर्‍यो, बिल्कुलै फरक पात्र। [१] [२]

source: Year Title Role Director Notes Source 1974 Maude Rita Valdez Hal Cooper TV series (1 episode: "Florida's Goodbye") [1] 1975 Hot l Baltimore April Green Bob LaHendro Burt Brinckerhoff TV series (13 episodes) [22] 1976 Deadly Hero Slugger Ann Ivan Nagy [24] Network Barbara Schlesinger Sidney Lumet [22] 1977 The Rockford Files Ella Mae White Reza Badiyi TV series (1 episode: "Crack Back") [13] Mixed Nuts Nurse Cassidy Jerry Belson Peter H. Hunt TV short [25] Blansky's Beauties Nurse Gibbons Alan Rafkin TV series (1 episode: "Nancy Breaks a Leg") [22] The Girl Called Hatter Fox Nurse Rinehart George Schaefer TV movie [22] Good Times Miss Johnson Gerren Keith TV series (1 episode: "Willona, the Fuzz") [22] One Day at a Time Phyllis McDermott Herbert Kenwith TV series (1 episode: "The Singles Bar") [22] 1978 A Death in Canaan Rita Parsons Tony Richardson TV movie [26] Who'll Save Our Children?
ne: Year Title Role Director Notes Source 1974 Maude Rita Valdez Hal Cooper TV series (1 episode: "Florida's Goodbye") [1] 1975 Hot l Baltimore April Green Bob LaHendro Burt Brinckerhoff TV series (13 episodes) [1] 1976 Deadly Hero Slugger Ann Ivan Nagy [2] Network Barbara Schlesinger Sidney Lumet [1] 1977 The Rockford Files Ella Mae White Reza Badiyi TV series (1 episode: "Crack Back") [3] Mixed Nuts Nurse Cassidy Jerry Belson Peter H. Hunt TV short [4] Blansky's Beauties Nurse Gibbons Alan Rafkin TV series (1 episode: "Nancy Breaks a Leg") [1] The Girl Called Hatter Fox Nurse Rinehart George Schaefer TV movie [1] Good Times Miss Johnson Gerren Keith TV series (1 episode: "Willona, the Fuzz") [1] One Day at a Time Phyllis McDermott Herbert Kenwith TV series (1 episode: "The Singles Bar") [1] 1978 A Death in Canaan Rita Parsons Tony Richardson TV movie [5] Who'll Save Our Children?

source: Dodie Hart George Schaefer (2) TV movie [22] 1979 The Love Boat Bitsy Sheldon Roger Duchowny TV series (2 episodes) [22] Heartland Elinore Randall Stewart Richard Pearce [22] Before and After Marge Kim Friedman TV movie [13] The Misadventures of Sheriff Lobo The Fox Bruce Bilson TV series (2 episodes) [27] B. J. and the Bear Wilhemina 'The Fox' Johnson Several directors TV series (4 episodes) [22] 1980 The Seduction of Miss Leona Hazel Dawson Joseph Hardy TV movie [13] Reunion Toni Owens Russ Mayberry TV movie [13] Rape and Marriage: The Rideout Case Helen Peter Levin TV movie [28] Knots Landing Mrs. Messinger Edward Parone TV series (2 episodes) [29] 1981 CBS Afternoon Playhouse Mamie Trotter Jeffrey Hayden TV series (1 episode: "The Great Gilly Hopkins") [13] McClain's Law Vangie Cruise Vincent McEveety TV movie (pilot for TV series McClain's Law) [13] Lou Grant Myra Wexler Peter Levin (2) TV series (1 episode: "Drifters") [13] B. J. and the Bear Wilhemina 'The Fox' Johnson Christian I. Nyby II TV series (1 episode: "B.J. and the Seven Lady Truckers: Part 2") [13] 1982 Quincy, M.E. Mrs. Werner Georg Fenady TV series (1 episode: "Into the Murdering Mind") [13] Life of the Party: The Story of Beatrice Captain Burnsite Lamont Johnson TV movie [9] Cagney & Lacey Charlene Reza Badiyi (2) TV series (1 episode: "High Steel") [13] 1983 St. Elsewhere Gina Barnett Mark Tinker TV series (1 episode: "Hearts") [22] American Playhouse Faye Doyle Michael Dinner TV series (1 episode: "Miss Lonelyhearts") [22] Emergency Room Nurse Sylvia Kaye Lee H. Katzin TV movie [13] 1984 Nadia Mili Simonescu Alan Cooke TV movie [22] Faerie Tale Theatre Thumbelina's Mother Michael Lindsay-Hogg TV series (1 episode: "Thumbelina") [22] The Three Wishes of Billy Grier Dr. Gardner Corey Blechman TV movie [13] 1984–85 E/R Nurse Joan Thor Peter Bonerz TV series (22 episodes) [22] 1985 This Is the Life Sharron Miller TV series (1 episode: "The Stranger") North Beach and Rawhide Doc Norman Harry Falk TV movie [13] 1986 Samaritan: The Mitch Snyder Story Ida Sinclair Richard T. Heffron TV movie [23] Where the River Runs Black Mother Marta Christopher Cain [13] Picnic Helen Potts Marshall W. Mason TV movie [13] Matlock Mrs. Reese Alan Cooke (2) TV series (1 episode: "The Sisters") [13] 1987 Night Court Nurse Jim Drake TV series (1 episode: "Here's to You, Mrs. Robinson") [13] Sledge Hammer!
ne: Dodie Hart George Schaefer (2) TV movie [1] 1979 The Love Boat Bitsy Sheldon Roger Duchowny TV series (2 episodes) [1] Heartland Elinore Randall Stewart Richard Pearce [1] Before and After Marge Kim Friedman TV movie [3] The Misadventures of Sheriff Lobo The Fox Bruce Bilson TV series (2 episodes) [6] B. J. and the Bear Wilhemina 'The Fox' Johnson Several directors TV series (4 episodes) [1] 1980 The Seduction of Miss Leona Hazel Dawson Joseph Hardy TV movie [3] Reunion Toni Owens Russ Mayberry TV movie [3] Rape and Marriage: The Rideout Case Helen Peter Levin TV movie [7] Knots Landing Mrs. Messinger Edward Parone TV series (2 episodes) [8] 1981 CBS Afternoon Playhouse Mamie Trotter Jeffrey Hayden TV series (1 episode: "The Great Gilly Hopkins") [3] McClain's Law Vangie Cruise Vincent McEveety TV movie (pilot for TV series McClain's Law) [3] Lou Grant Myra Wexler Peter Levin (2) TV series (1 episode: "Drifters") [3] B. J. and the Bear Wilhemina 'The Fox' Johnson Christian I. Nyby II TV series (1 episode: "B.J. and the Seven Lady Truckers: Part 2") [3] 1982 Quincy, M.E. Mrs. Werner Georg Fenady TV series (1 episode: "Into the Murdering Mind") [3] Life of the Party: The Story of Beatrice Captain Burnsite Lamont Johnson TV movie [9] Cagney & Lacey Charlene Reza Badiyi (2) TV series (1 episode: "High Steel") [3] 1983 St. Elsewhere Gina Barnett Mark Tinker TV series (1 episode: "Hearts") [1] American Playhouse Faye Doyle Michael Dinner TV series (1 episode: "Miss Lonelyhearts") [1] Emergency Room Nurse Sylvia Kaye Lee H. Katzin TV movie [3] 1984 Nadia Mili Simonescu Alan Cooke TV movie [1] Faerie Tale Theatre Thumbelina's Mother Michael Lindsay-Hogg TV series (1 episode: "Thumbelina") [1] The Three Wishes of Billy Grier Dr. Gardner Corey Blechman TV movie [3] 1984–85 E/R Nurse Joan Thor Peter Bonerz TV series (22 episodes) [1] 1985 This Is the Life Sharron Miller TV series (1 episode: "The Stranger") North Beach and Rawhide Doc Norman Harry Falk TV movie [3] 1986 Samaritan: The Mitch Snyder Story Ida Sinclair Richard T. Heffron TV movie [9] Where the River Runs Black Mother Marta Christopher Cain [3] Picnic Helen Potts Marshall W. Mason TV movie [3] Matlock Mrs. Reese Alan Cooke (2) TV series (1 episode: "The Sisters") [3] 1987 Night Court Nurse Jim Drake TV series (1 episode: "Here's to You, Mrs. Robinson") [3] Sledge Hammer!

source: Judge Ida Gruff Reza Badiyi (3) TV series (1 episode: "Jagged Sledge") [13] Frank's Place Jan Rudy Hugh Wilson TV series (1 episode: "The Bridge") [13] Eye on the Sparrow Mary John Korty TV movie [13] 1988 Hooperman Eva Parker Rick Wallace TV series (1 episode: "The Snitch") [13] For Keeps Mrs. Bobrucz John G. Avildsen [22] Who's the Boss?
ne: Judge Ida Gruff Reza Badiyi (3) TV series (1 episode: "Jagged Sledge") [3] Frank's Place Jan Rudy Hugh Wilson TV series (1 episode: "The Bridge") [3] Eye on the Sparrow Mary John Korty TV movie [3] 1988 Hooperman Eva Parker Rick Wallace TV series (1 episode: "The Snitch") [3] For Keeps Mrs. Bobrucz John G. Avildsen [1] Who's the Boss?

source: Frances James Eric Hornbeck TV series (1 episode: "Housekeepers Unite") [22] Sonny Spoon Tough Habit Dick Miller TV series (1 episode: "Tough Habit") [30] CBS Summer Playhouse Kate David Trainer TV series (1 episode: "Old Money") [13] Mystic Pizza Leona Donald Petrie [22] ABC Weekend Special Aunt Jill Ron Underwood TV series (1 episode: "Runaway Ralph") [13] Goodbye, Miss 4th of July George Miller TV Movie [13] Portrait of a White Marriage Mrs. Sturgeon Harry Shearer [13] 1988; 1991–92 L.A. Law Susan Bloom / Lorna Landsberg Several directors TV series (20 episodes) Nominated—Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series (1992) [13] 1989 A Peaceable Kingdom Kate Galindo Mark Waxman TV series (10 episodes) [22] Murder, She Wrote Harriet Lundgren John Llewellyn Moxey TV series (1 episode: "Something Borrowed, Someone Blue") [13] Your Mother Wears Combat Boots Specialist Mononaghee Anson Williams TV Movie [13] Hard Time on Planet Earth Annie James A. Contner TV series (1 episode: "The Hot Dog Man") [13] 1990 Hollywood Dog William Dear TV movie [13] Opposites Attract Flo Noel Nosseck TV movie [13] Edward Scissorhands Helen Tim Burton [22] 1991 Deadly Intentions...
ne: Frances James Eric Hornbeck TV series (1 episode: "Housekeepers Unite") [1] Sonny Spoon Tough Habit Dick Miller TV series (1 episode: "Tough Habit") [10] CBS Summer Playhouse Kate David Trainer TV series (1 episode: "Old Money") [3] Mystic Pizza Leona Donald Petrie [1] ABC Weekend Special Aunt Jill Ron Underwood TV series (1 episode: "Runaway Ralph") [3] Goodbye, Miss 4th of July George Miller TV Movie [3] Portrait of a White Marriage Mrs. Sturgeon Harry Shearer [3] 1988; 1991–92 L.A. Law Susan Bloom / Lorna Landsberg Several directors TV series (20 episodes) Nominated—Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series (1992) [3] 1989 A Peaceable Kingdom Kate Galindo Mark Waxman TV series (10 episodes) [1] Murder, She Wrote Harriet Lundgren John Llewellyn Moxey TV series (1 episode: "Something Borrowed, Someone Blue") [3] Your Mother Wears Combat Boots Specialist Mononaghee Anson Williams TV Movie [3] Hard Time on Planet Earth Annie James A. Contner TV series (1 episode: "The Hot Dog Man") [3] 1990 Hollywood Dog William Dear TV movie [3] Opposites Attract Flo Noel Nosseck TV movie [3] Edward Scissorhands Helen Tim Burton [1] 1991 Deadly Intentions...

source: Joan James Steven Sadwith TV movie [22] Chains of Gold Martha Burke Rod Holcomb TV movie [13] Backfield in Motion Ann Bedowski Richard Michaels TV movie [23] 1992–95 Hearts Afire Dr. Madeline Stoessinger / Dr. Ruth Colquist Several directors TV series (33 episodes) [13] 1993 The Legend of Prince Valiant Girl (voice) TV series (1 episode: "The Sage") [31] Dinosaurs Shelly (voice) Bruce Bilson (2) TV series (1 episode: "Dirty Dancin'") [13] Family Prayers Mrs. Romeyo Scott M. Rosenfelt [22] Sirens Mrs. Chattle TBA TV series (1 episode: "Keeping the Peace") [22] True Romance Mary Louise Ravencroft Tony Scott [22] Cobra Bobby Gutner Jorge Montesi TV series (1 episode: "Honeymoon Hideaway") [22] Heaven & Earth Bernice Oliver Stone [22] 1994 Samurai Cowboy Bobbi Bob Pickette Michael Keusch [22] A Worn Path Nurse Bruce Schwartz [13] Duckman Roxanne (voice) Jeff McGrath John Eng TV series (2 episodes) [13] 1995 The Buccaneers Mrs. Elmsworth Philip Saville TV miniseries (1 episode: "Invasion") [22] The Mask: Animated Series Willamina Bubask (voice) TV series (1 episode: "How Much Is That Dog in the Tin Can?") [13] The Client Rue James Quinn TV series (1 episode: "The Way Things Never Were") [13] 1996 Freeway Mrs. Sheets Matthew Bright [22] Minor Adjustments Mrs. Daisy Gotschel TV series (1 episode: "The Ungrateful Dead") [13] Walker, Texas Ranger Lureen Smith Michael Preece TV series (1 episode: "Miracle at Middle Creek") [13] Sweet Dreams Dr. Kate Lowe Jack Bender TV movie [13] Townies Marge Pamela Fryman TV series (2 episodes) [13] My Fellow Americans Woman Truck Driver Peter Segal [22] 1997 Touch Virginia Worrel Paul Schrader [13] ABC TGIF Pam TV series (1 episode: "Frightful Halloween Bash") [32] Aaahh!!!
ne: Joan James Steven Sadwith TV movie [1] Chains of Gold Martha Burke Rod Holcomb TV movie [3] Backfield in Motion Ann Bedowski Richard Michaels TV movie [9] 1992–95 Hearts Afire Dr. Madeline Stoessinger / Dr. Ruth Colquist Several directors TV series (33 episodes) [3] 1993 The Legend of Prince Valiant Girl (voice) TV series (1 episode: "The Sage") [11] Dinosaurs Shelly (voice) Bruce Bilson (2) TV series (1 episode: "Dirty Dancin'") [3] Family Prayers Mrs. Romeyo Scott M. Rosenfelt [1] Sirens Mrs. Chattle TBA TV series (1 episode: "Keeping the Peace") [1] True Romance Mary Louise Ravencroft Tony Scott [1] Cobra Bobby Gutner Jorge Montesi TV series (1 episode: "Honeymoon Hideaway") [1] Heaven & Earth Bernice Oliver Stone [1] 1994 Samurai Cowboy Bobbi Bob Pickette Michael Keusch [1] A Worn Path Nurse Bruce Schwartz [3] Duckman Roxanne (voice) Jeff McGrath John Eng TV series (2 episodes) [3] 1995 The Buccaneers Mrs. Elmsworth Philip Saville TV miniseries (1 episode: "Invasion") [1] The Mask: Animated Series Willamina Bubask (voice) TV series (1 episode: "How Much Is That Dog in the Tin Can?") [3] The Client Rue James Quinn TV series (1 episode: "The Way Things Never Were") [3] 1996 Freeway Mrs. Sheets Matthew Bright [1] Minor Adjustments Mrs. Daisy Gotschel TV series (1 episode: "The Ungrateful Dead") [3] Walker, Texas Ranger Lureen Smith Michael Preece TV series (1 episode: "Miracle at Middle Creek") [3] Sweet Dreams Dr. Kate Lowe Jack Bender TV movie [3] Townies Marge Pamela Fryman TV series (2 episodes) [3] My Fellow Americans Woman Truck Driver Peter Segal [1] 1997 Touch Virginia Worrel Paul Schrader [3] ABC TGIF Pam TV series (1 episode: "Frightful Halloween Bash") [12] Aaahh!!!
